@echo off
:: ****************************************
::
:: Автор скрипта Михаил Медведев aka mihanik
::
:: https://mihanik.net
::
::        Требуется наличие прав администратора: ДА
:: Антивирусная программа должна быть отключена: желательно, но не обязательно
::                                    Замечания: НЕТ
::
:: Описание
::
:: ****************************************

:: **************************************************
:: Проверяем наличие у пользователя админских прав.
:: Если таковых прав нет, завершаем работу скрипта...
:: **************************************************

SET HasAdminRights=0

FOR /F %%i IN ('WHOAMI /PRIV /NH') DO (
	IF "%%i"=="SeTakeOwnershipPrivilege" SET HasAdminRights=1
)

IF /I NOT "%HasAdminRights%"=="1" (
	echo.
	echo Вам нужны права администратора для запуска этого скрипта!
	echo.
	GOTO ENDSUB
)

if NOT defined ScriptPath (
	echo.
	echo Не определена переменная ScriptPath
	echo.
	GOTO ENDSUB
)

:: ****************************************************************************************
:: Устанавливаем Google Chrome
::
:: Google Chrome перестал быть основным браузером, поэтому его просто устанавливаем.
:: Без дополнительных настроек.
::
:: ****************************************************************************************

set "PathToGoogleChrome-x64=%ScriptPath%Distr\x64\GoogleChromeStandaloneEnterprise64.msi"

echo.
echo ========================================
echo Устанавливаем Google Chrome...
echo ========================================
echo.

msiexec.exe /i "%PathToGoogleChrome-x64%" /passive /norestart

:ENDSUB

timeout 3 /nobreak

EXIT /B
